Revit 2021.1 API
FormatOptions.IsValidUnitSymbol Method (DisplayUnitType, UnitSymbolType)
 Checks whether a unit symbol is valid for a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId, ForgeTypeId)` method instead.")]
public static bool IsValidUnitSymbol(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId, ForgeTypeId)` method instead.")> _
Public Shared Function IsValidUnitSymbol ( _
	displayUnit As DisplayUnitType, _
	unitSymbol As UnitSymbolType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId, ForgeTypeId)` method instead.")]
public:
static bool IsValidUnitSymbol(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
unitSymbol
Type: Autodesk.Revit.DB.UnitSymbolType
 The unit symbol to check.
Return Value
 True if the unit symbol is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
IsValidUnitSymbol Overload
Autodesk.Revit.DB Namespace